[
  {
    "id": 1,
    "title_en": "Driving Theory",
    "title_ml": "ഡ്രൈവിംഗ് തിയറി",
    "color": "#a2f7f0ff",
    "english": [
      "Driving is a responsibility that demands full attention, awareness, and discipline. Every time you sit behind the steering wheel, you are controlling a machine powerful enough to cause major damage if mishandled. Understanding this responsibility helps drivers stay cautious and avoid taking unnecessary risks. A safe driver always stays calm, avoids aggression, and respects all road users, including pedestrians and cyclists.",
      "Before starting your journey, it is important to inspect essential vehicle components such as brakes, mirrors, tyre pressure, indicators, wipers, and lights. Performing these basic checks reduces the chances of unexpected breakdowns or accidents caused by mechanical failure. A well-maintained vehicle responds better, provides smoother control, and increases safety for both the driver and people on the road.",
      "Traffic rules exist to protect everyone, and following them is the foundation of safe driving. Speed limits, traffic signals, lane markings, and road signs are designed to prevent dangerous situations. Ignoring these rules not only puts your life at risk but also endangers others. A responsible driver must always follow lane discipline, avoid overspeeding, and give proper signals before turning or changing lanes.",
      "Distractions are one of the biggest causes of road accidents. Using mobile phones, eating food, adjusting music, or even talking too much while driving can reduce your reaction time. A moment of distraction can be enough to cause a collision. To drive safely, your mind and eyes should stay focused on the road, your surroundings, and the behavior of other drivers.",
      "Defensive driving is the habit of predicting and avoiding potential danger. It involves maintaining a safe distance, staying alert at intersections, slowing down near crowded areas, and expecting unexpected actions from other drivers. Even if you follow all rules, others may not. Defensive driving helps you stay prepared and prevents many accidents from happening.","Road signs are an essential part of driving because they provide crucial information that helps ensure safety and smooth traffic flow. They warn drivers about potential hazards, give instructions, and show directions. A driver who clearly understands road signs can make quick and accurate decisions while driving, reducing the chances of confusion or mistakes.",
      "Warning signs notify drivers about upcoming dangers such as sharp curves, school zones, animal crossings, or uneven roads. Seeing these signs in advance allows the driver to slow down, stay alert, and prepare for unexpected situations. This is especially important in areas with limited visibility, such as hills or narrow roads.",
      "Mandatory signs give instructions that drivers must follow without fail. These include speed limits, one-way signs, stop signs, and no-entry boards. Ignoring these signs can lead to accidents, traffic blocks, or fines. They are placed strategically in areas where strict control is necessary to maintain road discipline.",
      "Informational and guide signs help drivers by providing useful information such as hospital locations, fuel stations, parking areas, and route directions. These signs play a major role during long trips or when traveling in an unfamiliar place. By following them, drivers can reach their destination safely and efficiently.",
      "A good driver should develop the habit of constantly observing and interpreting road signs while driving. Regular practice, reading, and real-road experience help improve sign recognition skills. A strong knowledge of road signs is also essential for passing the driving test and becoming a confident, responsible driver."
    ],
    "malayalam": [
      "ഡ്രൈവിംഗ് ഒരു വലിയ ഉത്തരവാദിത്വമുള്ള പ്രവർത്തനമാണ്, ഇത് മുഴുവൻ ശ്രദ്ധയും ജാഗ്രതയും ശാസനയുമാണ് ആവശ്യപ്പെടുന്നത്. സ്റ്റിയറിംഗ് വീലിന് പിന്നിൽ ഇരിക്കുമ്പോൾ, നിങ്ങൾ സുരക്ഷിതമായി നിയന്ത്രിക്കാത്ത പക്ഷം വലിയ അപകടങ്ങൾക്ക് കാരണമാകാവുന്ന ശക്തിയുള്ള യന്ത്രമാണ് നിയന്ത്രിക്കുന്നത്. ഈ ഉത്തരവാദിത്വം മനസ്സിലാക്കുന്നത് ഡ്രൈവറെ കൂടുതൽ ജാഗ്രതയോടും ശാന്തതയോടും പ്രവർത്തിക്കാൻ സഹായിക്കുന്നു. സുരക്ഷിത ഡ്രൈവർ എപ്പോഴും ശാന്തനായി, ക്ഷമയോടെ, പാദചാരികളെയും മറ്റ് വാഹനങ്ങളെയും ബഹുമാനിച്ച് ഡ്രൈവ് ചെയ്യുന്നു.",
      "യാത്ര തുടങ്ങുന്നതിന് മുമ്പ് ബ്രേക്ക്, മിറർ, ടയർ പ്രഷർ, ഇൻഡിക്കേറ്റർ, വൈപ്പർ, ലൈറ്റുകൾ എന്നിവ പരിശോധിക്കുന്നത് അത്യാവശ്യമാണ്. ഇത്തരം അടിസ്ഥാന പരിശോധനകൾ യന്ത്ര തകരാറുകൾ മൂലമുള്ള അപകടങ്ങളും അനിഷ്ട സംഭവങ്ങളും കുറയ്ക്കാൻ സഹായിക്കുന്നു. നന്നായി പരിപാലിക്കുന്ന ഒരു വാഹനം മികച്ച നിയന്ത്രണം നൽകുകയും ഡ്രൈവറുടെയും മറ്റ് യാത്രക്കാരുടെയും സുരക്ഷ ഉറപ്പാക്കുകയും ചെയ്യുന്നു.",
      "ട്രാഫിക് നിയമങ്ങൾ എല്ലാവരുടെയും സുരക്ഷയ്ക്കായി രൂപകൽപ്പന ചെയ്തതാണ്. സ്പീഡ് ലിമിറ്റ്, ട്രാഫിക് സിഗ്നൽ, ലെയിൻ മാർക്കിംഗ്, റോഡ് സൈൻ എന്നിവ അപകടങ്ങൾ ഒഴിവാക്കാൻ സഹായിക്കുന്നതാണ്. ഈ നിയമങ്ങൾ അവഗണിക്കുന്നത് ഡ്രൈവറെയും റോഡിലുള്ള മറ്റുള്ളവരെയും അപകടത്തിൽ ആക്കും. ഒരു സുരക്ഷിത ഡ്രൈവർ എപ്പോഴും ലെയിൻ ഡിസിപ്ലിൻ പാലിക്കുകയും, അതിവേഗത്തിൽ പോകാതിരിക്കുകയും, തിരിയുന്നതിനു മുമ്പ് ശരിയായ സിഗ്നൽ നൽകുകയും വേണം.",
      "ശ്രദ്ധതിരിച്ചിലുകൾ അപകടങ്ങളുടെ പ്രധാന കാരണങ്ങളിൽ ഒന്നാണ്. മൊബൈൽ ഫോൺ ഉപയോഗിക്കൽ, ഭക്ഷണം കഴിക്കൽ, സംഗീതം ക്രമീകരിക്കൽ, അത്യധികം സംസാരിക്കൽ എന്നിവ പ്രതികരണ സമയത്തെ കുറയ്ക്കും. ഒരു നിമിഷത്തിന്റെ ശ്രദ്ധക്കുറവ് പോലും വലിയ അപകടത്തിന് കാരണമാകും. അതിനാൽ ഡ്രൈവ് ചെയ്യുമ്പോൾ കണ്ണും മനസ്സും പൂർണമായി റോഡിലും ചുറ്റുപാടുകളിലും കേന്ദ്രീകരിച്ചിരിക്കണം.",
      "ഡിഫൻസീവ് ഡ്രൈവിംഗ് അപകടങ്ങളെ മുൻകൂട്ടി കണക്കാക്കി അവ ഒഴിവാക്കുന്നതിനുള്ള കഴിവാണ്. സുരക്ഷിത ദൂരം പാലിക്കൽ, ജങ്ഷനുകൾക്ക് സമീപം ജാഗ്രത, തിരക്കേറിയ സ്ഥലങ്ങളിൽ വേഗം കുറയ്ക്കൽ, മറ്റ് ഡ്രൈവർമാരുടെ അപ്രതീക്ഷിത പ്രവർത്തനങ്ങൾ പ്രവചിക്കൽ എന്നിവ ഇതിൽപ്പെടുന്നു. നിങ്ങൾ നിയമങ്ങൾ പാലിച്ചാലും മറ്റുള്ളവർ അത് എപ്പോഴും പാലിക്കണമെന്നില്ല, അതിനാൽ സജ്ജമായിരിക്കുക അത്യാവശ്യമാണ്.", "റോഡ് സൈൻകൾ ഡ്രൈവിംഗിന്റെ ഒരു പ്രധാന ഘടകമാണ്, കാരണം ഇവ സുരക്ഷയും സ്മൂത്ത് ട്രാഫിക് ഫ്ലോയും ഉറപ്പാക്കുന്നതിനുള്ള നിർണ്ണായക വിവരങ്ങൾ നൽകുന്നു. അപകട സാധ്യതകൾ മുന്നറിയിപ്പായി നൽകുകയും, നിർദ്ദേശങ്ങൾ നൽകുകയും, ദിശകൾ കാണിച്ചുതരുകയും ചെയ്യുന്നു. റോഡ് സൈൻകൾ വ്യക്തമായി മനസ്സിലാക്കുന്ന ഒരു ഡ്രൈവർക്ക് വേഗത്തിലും ശരിയായി തീരുമാനങ്ങൾ എടുക്കാൻ കഴിയും, ഇത് അപകടങ്ങളും ആശയക്കുഴപ്പങ്ങളും കുറയ്ക്കാൻ സഹായിക്കുന്നു.",
      "മുന്നറിയിപ്പ് സൈൻകൾ വരാനിരിക്കുന്ന അപകടസാധ്യതകളെക്കുറിച്ച് ഡ്രൈവർമാരെ അറിയിക്കുന്നു — കൂർത്ത വളവുകൾ, സ്കൂൾ സോൺ, മൃഗങ്ങൾ കടന്നുപോകുന്ന പ്രദേശങ്ങൾ, എളുപ്പത്തിൽ വഴുതുന്ന റോഡുകൾ എന്നിവയെക്കുറിച്ച് സൂചന നൽകുന്നു. ഈ സൈൻകൾ നേരത്തെ ശ്രദ്ധയിൽപെട്ടാൽ വേഗം കുറയ്ക്കാനും ജാഗ്രത പാലിക്കാനും സാധിക്കും.",
      "മാൻഡേറ്ററി സൈൻകൾ ഡ്രൈവർ നിർബന്ധമായും പാലിക്കേണ്ട നിയമങ്ങളാണ്. സ്പീഡ് ലിമിറ്റ്, വൺ വേ, സ്റ്റോപ്പ്, നോ എൻട്രി എന്നിവ ഇതിൽപ്പെടുന്നു. ഇവ അവഗണിക്കുന്നത് അപകടങ്ങൾക്കും ട്രാഫിക് കുരുക്കുകൾക്കും പിഴയ്ക്കും കാരണമാകാം. റോഡിലെ ശാസ്ത്രീയ നിയന്ത്രണം നിലനിർത്താൻ ഇവ നിർണ്ണായകമാണ്.",
      "ഇൻഫർമേഷൻ സൈൻകളും ഗൈഡ് ബോർഡുകളും ആശുപത്രി, ഫ്യൂവൽ സ്റ്റേഷൻ, പാർക്കിംഗ് ഏരിയ, റൂട്ട് ദിശകൾ എന്നിവയെക്കുറിച്ചുള്ള ഉപകാരപ്രദമായ വിവരങ്ങൾ നൽകുന്നു. പരിചയമില്ലാത്ത സ്ഥലങ്ങളിൽ യാത്ര ചെയ്യുമ്പോഴും ദൂരയാത്രക്കിടയിലും ഇത് ഏറ്റവും സഹായകരമാണ്. ഇവ പിന്തുടർന്നാൽ യാത്ര കൂടുതൽ സുരക്ഷിതവും കാര്യക്ഷമവും ആയിരിക്കും.",
      "ഡ്രൈവർമാർ സ്ഥിരമായി റോഡ് സൈൻകൾ ശ്രദ്ധിക്കുകയും ശരിയായി വ്യാഖ്യാനിക്കുകയും ചെയ്യുന്ന ശീലം വികസിപ്പിക്കണം. പതിവായി പ്രാക്ടീസ് ചെയ്യുന്നതും യഥാർത്ഥ റോഡ് അനുഭവങ്ങളും സൈൻ തിരിച്ചറിയാനുള്ള കഴിവ് മെച്ചപ്പെടുത്തും. ഡ്രൈവിംഗ് ടെസ്റ്റ് പാസ്സാക്കാനും ആത്മവിശ്വാസമുള്ള, ഉത്തരവാദിത്വമുള്ള ഡ്രൈവർ ആകാനും റോഡ് സൈൻകളിലെ അറിവ് അത്യാവശ്യമാണ്."
    ]
},
  {
    "id": 2,
    "title_en": "Law of Pedestrians",
    "title_ml": "പാതയാത്രക്കാരുടെ നിയമങ്ങൾ",
    "category": "law_of_pedestrian",
    "color": "#FEE6E1",
    "english": [
      "Pedestrian safety is a major part of road rules, and every driver must understand pedestrian laws clearly. Pedestrians are the most vulnerable users on the road because they do not have any physical protection. Therefore, drivers must always stay alert when driving near bus stops, markets, school zones, and residential areas where people frequently walk. Giving priority to pedestrians is not just a rule but a moral responsibility that ensures the safety of everyone using the road.",
      "Crosswalks and zebra crossings are designated areas created specifically for pedestrian movement. When a pedestrian steps on a zebra crossing, vehicles must stop immediately and allow them to cross safely. Even if there is no traffic signal, the pedestrian has the right of way at a marked crosswalk. Drivers who fail to stop or try to rush through the crossing not only violate the law but also put lives at risk.",
      "Pedestrian signals such as 'Walk' and 'Don't Walk' indicators help manage movement in crowded junctions. Drivers must carefully watch these signals and allow pedestrians to cross whenever the pedestrian signal is green. Blocking a pedestrian crossing or stopping the vehicle on a zebra line is strictly prohibited. It reduces visibility, causes confusion, and increases the chances of accidents.",
      "Children, elderly people, and disabled individuals require extra care from drivers. They may walk slowly, react unpredictably, or struggle to cross the road quickly. Drivers must reduce speed near pedestrian-heavy areas and maintain a safe distance. Mistakes made by pedestrians should not be met with aggression; instead, the driver must anticipate such mistakes and respond calmly.",
      "The law also states that pedestrians should use sidewalks whenever available and avoid walking on the main road unless necessary. They must cross roads only at designated points like zebra crossings or pedestrian bridges. Both drivers and pedestrians share equal responsibility in preventing accidents. When both follow their respective rules, roads become significantly safer and more organized."
    ],
    "malayalam": [
      "പാദചാരികളുടെ സുരക്ഷ റോഡ് നിയമങ്ങളുടെ ഒരു പ്രധാന ഭാഗമാണ്, ഏതു ഡ്രൈവർമാരും ഇത് വ്യക്തമായി മനസ്സിലാക്കണം. പാദചാരികൾക്ക് യാതൊരു സംരക്ഷണവും ഇല്ലാത്തതിനാൽ അവർ റോഡിലെ ഏറ്റവും അപകടസാധ്യതയുള്ള വിഭാഗമാണ്. അതിനാൽ ബസ് സ്റ്റോപ്പ്, മാർക്കറ്റ്, സ്കൂൾ സോൺ, താമസ പ്രദേശങ്ങൾ പോലുള്ള ആളുകൾ കൂടുതലായി നടക്കുന്ന ഇടങ്ങളിൽ ഡ്രൈവർ എപ്പോഴും ജാഗ്രത പാലിക്കണം. പാദചാരികൾക്ക് മുൻഗണന നൽകുന്നത് ഒരു നിയമബാധ്യത മാത്രമല്ല, ഒരു മാനുഷിക ഉത്തരവാദിത്വവുമാണ്.",
      "സീബ്ര ക്രോസിംഗുകളും ക്രോസ്‌വോകുകളും പാദചാരികൾക്കായി പ്രത്യേകമായി സൃഷ്ടിച്ചിരിക്കുന്ന ഇടങ്ങളാണ്. ഒരു പാദചാരി സീബ്ര ക്രോസിംഗിൽ കാലുകുത്തുന്ന നിമിഷം തന്നെ വാഹനങ്ങൾ നിർത്തി അവരെ സുരക്ഷിതമായി കടക്കാന്‍ അനുവദിക്കണം. ട്രാഫിക് സിഗ്നൽ ഇല്ലെങ്കിലും മാർക്ക് ചെയ്ത ക്രോസ്‌വോകിൽ പാദചാരിക്കാണ് മുൻഗണന. വണ്ടി നിർത്താതെ ക്രോസിംഗിലൂടെ വേഗത്തിൽ കടക്കാൻ ശ്രമിക്കുന്നതും ഒരു ഗുരുതര നിയമലംഘനമാണ്.",
      "‘വോക്ക്’, ‘ഡോൺട് വോക്ക്’ പോലുള്ള പാദചാരികൾക്കായുള്ള സിഗ്നലുകൾ തിരക്കേറിയ ജങ്ഷനുകളിൽ ആളുകളുടെ നീക്കം സുരക്ഷിതമായി നിയന്ത്രിക്കാൻ സഹായിക്കുന്നു. ഈ സിഗ്നലുകൾ ശ്രദ്ധിച്ച് പാദചാരികൾക്ക് പച്ച ലൈറ്റ് ലഭിക്കുമ്പോൾ അവരെ കടക്കാൻ അനുവദിക്കണം. സീബ്ര ലൈനിൽ വാഹനങ്ങൾ നിർത്തുന്നതോ ക്രോസിംഗ് തടസ്സപ്പെടുത്തുന്നതോ നിയമവിരുദ്ധവും അപകട സാധ്യത വർധിപ്പിക്കുന്നതുമാണ്.",
      "കുട്ടികൾ, മുതിർന്നവർ, വൈകല്യമുള്ളവർ എന്നിവർക്കായി ഡ്രൈവർ കൂടുതൽ ജാഗ്രത പുലർത്തണം. ഇവർ മന്ദഗതിയിലോ അപ്രതീക്ഷിതമായി പ്രതികരിക്കുകയോ ചെയ്യാം. അതിനാൽ ഇത്തരം സ്ഥലങ്ങളിൽ വേഗം കുറയ്ക്കുകയും സുരക്ഷിത ദൂരം പാലിക്കുകയും വേണം. പാദചാരികളുടെ പിഴവുകൾക്ക് നേരെ കോപത്തോടെ പ്രതികരിക്കുന്നത് അപകടം വർധിപ്പിക്കും; പകരം അവരുടെ പിഴവ് മുൻകൂട്ടി കണക്കാക്കി ശാന്തമായി പ്രതികരിക്കണം.",
      "നിയമപ്രകാരം പാദചാരികൾ പാതയോര പാതകൾ ലഭ്യമാണെങ്കിൽ അവ ഉപയോഗിക്കണം; അത്യാവശ്യമായില്ലെങ്കിൽ റോഡിന്റെ നടുവിലൂടെ നടക്കരുത്. റോഡ് കടക്കുന്നതിനും സീബ്ര ക്രോസിംഗ് അല്ലെങ്കിൽ പാദചാരിപാലം പോലുള്ള നിശ്ചിത ഇടങ്ങൾ മാത്രം ഉപയോഗിക്കണം. അപകടങ്ങൾ ഒഴിവാക്കാൻ ഡ്രൈവർകളും പാദചാരികളും തുല്യ ഉത്തരവാദിത്വം പങ്കിടുന്നു.ഇരുവരും തങ്ങളുടെ നിയമങ്ങൾ പാലിച്ചാൽ റോഡുകൾ കൂടുതൽ സുരക്ഷിതവും ക്രമസമതയുള്ളതുമാകും."
    ]
  },
  {
    "id": 3,
    "title_en": "Road and Road Markings",
    "title_ml": "റോഡുകളും റോഡ് മാർക്കിംഗുകളും",
    "color": "#E1F2FE",
    "english": [
      "Roads are built to ensure smooth and safe movement of vehicles and pedestrians, and understanding their structure is essential for every driver. A standard road consists of lanes, shoulders, footpaths, medians, and intersections. Each part has a specific purpose, and knowing how they function helps drivers follow proper driving discipline. For example, the left side is usually meant for slow-moving vehicles, while the right side is used for overtaking or faster movement. Understanding the layout of the road reduces confusion and makes driving more predictable and safe.",
      "Road markings play a crucial role in communicating road rules without the need for signboards. These markings guide drivers on lane usage, stopping points, pedestrian areas, and turning restrictions. White and yellow lines, arrows, zebra crossings, and chevrons provide constant visual instructions. Even in situations where traffic police or signals are not present, proper road markings ensure smooth traffic flow. Drivers who pay attention to these markings are less likely to make mistakes or violate rules.",
      "The center line on the road divides traffic moving in opposite directions. A continuous yellow center line means overtaking is strictly prohibited because the area may be dangerous, such as curves, narrow roads, or hills with low visibility. A broken yellow line allows overtaking when the road is clear. Some roads have a combination of solid and broken lines, meaning the vehicle on the broken-line side may overtake while the other side cannot. Understanding these markings prevents head-on collisions and risky maneuvers.",
      "Lane markings help drivers stay within their lanes and maintain proper alignment. Broken white lane lines indicate that vehicles may change lanes with caution, while continuous white lane lines mean lane changing is not allowed. Arrows painted on the road indicate the direction of movement allowed in each lane—for example, straight-only, left-turn, or right-turn lanes. Following lane markings is important during intersections to prevent confusion and accidents, especially in high-traffic areas.",
      "Stop lines, zebra crossings, and box junction markings are designed to protect pedestrians and ensure safe road interactions. A stop line tells the driver exactly where to stop the vehicle at signals or junctions. Vehicles must never stop on top of a zebra crossing because it blocks pedestrian movement. Box junctions, marked with yellow crisscross lines, indicate that vehicles should not enter unless the exit is clear, preventing traffic jams in intersections. Respecting these markings ensures smooth coordination between drivers and pedestrians."
    ],
    "malayalam": [
      "വാഹനങ്ങളും പാദചാരികളും സുരക്ഷിതമായും ക്രമബദ്ധമായും സഞ്ചരിക്കുന്നതിനായി റോഡുകൾ രൂപകൽപ്പന ചെയ്യപ്പെട്ടതാണ്. ഒരു സാധാരണ റോഡിൽ ലെയിനുകൾ, ഷോൾഡർ, ഫുട്‌പാത്, മീഡിയൻ, ജംഗ്ഷൻ എന്നിവ ഉൾപ്പെടുന്നു. ഓരോ ഭാഗത്തിനും പ്രത്യേകമായ ഒരു ഉദ്ദേശ്യമുണ്ട്. റോഡിന്റെ ഘടന മനസ്സിലാക്കുന്നത് ഡ്രൈവർമാരെ കൂടുതൽ മുൻകൂട്ടി കണക്കാക്കി സുരക്ഷിതമായി ഡ്രൈവ് ചെയ്യാൻ സഹായിക്കുന്നു. ഉദാഹരണത്തിന്, ഇടത് ഭാഗം സാധാരണയായി മന്ദഗതിയിലുള്ള വാഹനങ്ങൾക്ക് വേണ്ടിയുള്ളതാണ്, വലത് ഭാഗം ഓവർടേക്കിംഗിനോ വേഗതയേറിയയാത്രയ്ക്കോ ഉപയോഗിക്കപ്പെടുന്നു.",
      "റോഡ് മാർക്കിംഗുകൾ സൈൻബോർഡുകളില്ലാതെയും ഡ്രൈവർമാരെ നിർദ്ദേശങ്ങൾ നൽകുന്ന അത്യാവശ്യ ഘടകങ്ങളാണ്. ലെയിൻ ഉപയോഗം, നിർത്തേണ്ട സ്ഥലം, പാദചാരികൾക്കുള്ള പ്രദേശം, തിരിവുകൾ എന്നിവയെക്കുറിച്ച് ഈ മാർക്കിംഗുകൾ സൂചന നൽകുന്നു. വെള്ളയും മഞ്ഞയും വരകൾ, തിരിമുറുക്കു അടയാളങ്ങൾ, സീബ്ര ക്രോസിംഗ്, ചെവ്രോൺ മാർക്കിംഗ് എന്നിവ ഡ്രൈവർമാരെ നിരന്തരം മാർഗനിർദ്ദേശം ചെയ്യുന്നു. ട്രാഫിക് പൊലീസ് ഇല്ലാത്തിടത്തും സിഗ്നലുകൾ പ്രവർത്തിക്കാത്തിടത്തും റോഡ് മാർക്കിംഗുകൾ ട്രാഫിക് നിയന്ത്രണത്തിൽ വലിയ പങ്ക് വഹിക്കുന്നു.",
      "റോഡിന്റെ മധ്യത്തിലുണ്ടാകുന്ന കേന്ദ്രരേഖ മറുകാര്യ ദിശയിൽ സഞ്ചരിക്കുന്ന വാഹനങ്ങളെ വേർതിരിക്കുന്നു. തുടർച്ചയായ മഞ്ഞ രേഖ ഉള്ളിടത്ത് ഓവർടേക്കിംഗ് പൂർണമായി നിരോധിച്ചിരിക്കുന്നു, കാരണം അത് കൂർത്ത വളവുകൾ, കുന്നുകൾ, ദൃശ്യപരത കുറഞ്ഞ ഭാഗങ്ങൾ പോലുള്ള അപകടസാധ്യതയുള്ള പ്രദേശങ്ങളായിരിക്കും.ഇടവിട്ട മഞ്ഞ രേഖ ഉള്ളിടത്ത്, റോഡ് ശുദ്ധമാണെങ്കിൽ ഓവർടേക്കിംഗ് ചെയ്യാം. ചില റോഡുകളിൽ തുടർച്ചയായതും ഇടവിട്ടതുമായ വരകൾ ഒരുമിച്ച് കാണാം; അത്തരത്തിൽ ഇടവിട്ട വരയുള്ള ഭാഗത്തുള്ള വാഹനങ്ങൾക്ക് മാത്രമേ ഓവർടേക്കിംഗ് ചെയ്യാൻ കഴിയൂ.",
      "ലെയിൻ മാർക്കിംഗുകൾ ഡ്രൈവർമാരെ അവരുടെ ലെയിനുകളിൽ ശരിയായി നിലനിർത്താൻ സഹായിക്കുന്നു. ഇടവിട്ട വെള്ള വരകൾ ലെയിൻ മാറ്റം അനുവദിക്കുന്നുവെങ്കിലും സൂക്ഷിച്ച് ചെയ്യണമെന്ന് സൂചിപ്പിക്കുന്നു. പക്ഷേ തുടർച്ചയായ വെള്ള വരകൾ ലെയിൻ മാറ്റം നിരോധിക്കുന്നതാണ്. റോഡിൽ വരച്ചിരിക്കുന്ന അമ്പുകൾ ഓരോ ലെയിനും ഏത് ദിശയിലാണ് പോകേണ്ടതെന്ന് വ്യക്തമാക്കുന്നു — നേരേ, ഇടത്, വലത് എന്നിവ. ജംഗ്ഷനുകളിൽ ഇത്തരം മാർക്കിംഗുകൾ പാലിച്ചാൽ ആശയക്കുഴപ്പവും അപകടങ്ങളും കുറയുന്നു.",
      "സ്റ്റോപ്പ് ലൈൻ, സീബ്ര ക്രോസിംഗ്, ബോക്സ് ജംഗ്ഷൻ മാർക്കിംഗ് എന്നിവ പാദചാരികളുടെ സുരക്ഷയ്ക്കും ട്രാഫിക് നിയന്ത്രണത്തിനും വേണ്ടിയാണ് രൂപകൽപ്പന ചെയ്തിരിക്കുന്നത്. സ്റ്റോപ്പ് ലൈൻ സിഗ്നൽ അല്ലെങ്കിൽ ജങ്ഷനിൽ വാഹനം എവിടെയാണ് നിർത്തേണ്ടത് എന്നു വ്യക്തമാക്കുന്നു. സീബ്ര ക്രോസിംഗിന് മുകളിൽ വാഹനം നിർത്തുന്നത് നിയമവിരുദ്ധമാണ്. ബോക്സ് ജംഗ്ഷനുകളിൽ (മഞ്ഞ ചെക്ക് മാർക്കിംഗ്) എക്സിറ്റ് ഭാഗം ശുദ്ധമാകുന്നത് വരെ പ്രവേശിക്കരുത്. ഈ മാർക്കിംഗുകൾ ബഹുമാനിക്കുന്നത് ട്രാഫിക് തിരക്ക് കുറയ്ക്കുകയും പാദചാരികൾക്ക് സുരക്ഷ ഉറപ്പാക്കുകയും ചെയ്യുന്നു."
    ]
  },
  {
  "id": 4,
  "title_en": "Safety Driving Practices",
  "title_ml": "സുരക്ഷിത ഡ്രൈവിംഗ് രീതികൾ",
  "color": "#5993C9",
  "english": [
    "Safe driving begins before you even start your vehicle. A responsible driver must perform a quick pre-drive inspection every day by checking tyre pressure, mirrors, fuel level, brakes, lights, and horn to ensure everything is functioning correctly. Adjusting the seat properly and wearing the seat belt is the very first step of safe driving. These simple habits reduce unexpected breakdowns and help you stay confident and alert on the road.",
    "One of the most important principles of safe driving is maintaining a safe following distance. Drivers should always follow the 'three-second rule,' which means keeping enough space between your vehicle and the vehicle in front so you have enough time to react. This distance must be increased during rain, fog, night driving, or when the road has gravel or mud. Most accidents occur because drivers fail to estimate stopping distance correctly.",
    "Speed control is another powerful safety factor. Driving within the speed limit is not just a rule but a life-saving practice. High speeds reduce reaction time and increase the force of collisions. Responsible drivers slow down near schools, hospitals, pedestrian crossings, blind curves, junctions, and residential areas. Accelerating smoothly and braking early helps maintain your vehicle’s stability and improves fuel efficiency as well.",
    "Distraction-free driving is one of the biggest priorities in modern traffic. Mobile phones, loud music, eating while driving, and adjusting the display or GPS can take your eyes off the road for even a second, which is enough to cause a crash. Always use hands-free devices only when absolutely necessary, and never text while driving. Staying mentally calm, focused, and aware of your surroundings is the strongest safety technique a driver can adopt.",
    "Defensive driving is the art of anticipating danger and preparing to avoid it. A good driver always expects other drivers to make mistakes and stays ready with an escape plan. This includes checking mirrors frequently, understanding blind spots, keeping both hands on the steering wheel, and giving clear signals in advance. Respecting other road users, such as pedestrians, cyclists, heavy vehicles, and emergency vehicles, helps create a safe and cooperative road environment for everyone."
  ],
  "malayalam": [
    "വാഹനം സ്റ്റാർട്ട് ചെയ്യുന്നതിന് മുമ്പ് തന്നെ സുരക്ഷിത ഡ്രൈവിംഗിന് തുടക്കം കുറിക്കണം. ദിവസേന ഒരു ചെറിയ പ്രീ-ഡ്രൈവ് പരിശോധന നടത്തണം—ടയർ പ്രഷർ, കണ്ണാടികൾ, ഫ്യുവൽ ലെവൽ, ബ്രേക്ക്, ലൈറ്റ്, ഹോൺ എന്നിവ ശരിയായി പ്രവർത്തിക്കുന്നുണ്ടോ എന്ന് പരിശോധിക്കുക. സീറ്റ് ശരിയായി ക്രമപ്പെടുത്തി സീറ്റ് ബെൽറ്റ് ധരിക്കുന്നത് സുരക്ഷിത ഡ്രൈവിംഗിന്റെ അടിസ്ഥാനഘടകമാണ്. ഈ ചെറിയ ശീലങ്ങൾ അപ്രതീക്ഷിത തകരാറുകൾ ഒഴിവാക്കുകയും ഡ്രൈവർമാരെ കൂടുതൽ ജാഗ്രതയുള്ളവരാക്കിയെടുക്കുകയും ചെയ്യുന്നു.",
    "സുരക്ഷിത ഡ്രൈവിംഗിൽ ഏറ്റവും പ്രധാനപ്പെട്ടത് സുരക്ഷിത അകലം പാലിക്കലാണ്. ഡ്രൈവർമാർ എല്ലായ്പ്പോഴും ‘മൂന്ന് സെക്കന്റ് നിയമം’ പാലിക്കണം. voertuകിയ്ക്കും മുന്നിലുള്ള വാഹനത്തിനും ഇടയിൽ മൂന്ന് സെക്കന്റ് പ്രതികരണ സമയം ലഭിക്കുന്നത്ര സ്ഥലം വിട്ടുകൊടുക്കണം. മഴ, മൂടൽമഞ്ഞ്, രാത്രി ഡ്രൈവിംഗ്, പൂഴ്മൺ, ചെളി എന്നിവയുള്ള സാഹചര്യങ്ങളിൽ ഈ ദൂരം കൂടി വർദ്ധിപ്പിക്കണം. മിക്ക അപകടങ്ങളും സ്റ്റോപ്പിംഗ് ദൂരം കൃത്യമായി കണക്കാക്കാൻ കഴിയാത്തതു കൊണ്ടാണ് സംഭവിക്കുന്നത്.",
    "വേഗനിയന്ത്രണം സുരക്ഷിതത്വം ഉറപ്പാക്കുന്ന മറ്റൊരു പ്രധാന കാര്യമാണ്. നിശ്ചിത വേഗപരിധിക്കുള്ളിൽ ഡ്രൈവ് ചെയ്യുക ഒരു നിയമമാത്രമല്ല, മറിച്ച് ജീവൻ രക്ഷിക്കാനുള്ള ശീലവുമാണ്. വേഗം കൂടുമ്പോൾ പ്രതികരണ സമയം കുറയുകയും ഇടിയുടെ ശക്തി കൂടുതലാകുകയും ചെയ്യും. സ്കൂളുകൾ, ആശുപത്രികൾ, പേടെസ്ട്രിയൻ ക്രോസിംഗുകൾ, ബ്ലൈൻഡ് വളവുകൾ, ജങ്ഷനുകൾ, താമസ കേന്ദ്രങ്ങൾ എന്നിവയ്ക്കരികിൽ ഡ്രൈവർമാർ വേഗം കുറയ്ക്കണം.",
    "ധ്യാപനമില്ലാത്ത ഡ്രൈവിംഗ് ആധുനിക ട്രാഫിക്കിൽ വളരെ പ്രധാനമാണ്. മൊബൈൽ ഫോൺ ഉപയോഗം, ഉച്ചത്തിലുള്ള സംഗീതം, ഭക്ഷണം കഴിക്കുമ്പോൾ ഡ്രൈവ് ചെയ്യൽ, സ്ക്രീൻ അല്ലെങ്കിൽ GPS ക്രമപ്പെടുത്തൽ തുടങ്ങിയവ ഒരു സെക്കൻഡ് പോലും ശ്രദ്ധ തെറ്റിച്ചാൽ അപകടത്തിന് കാരണമാകും.അത്യാവശ്യം അല്ലെങ്കിൽ കൈ മോചിപ്പിക്കാത്ത ഉപകരണങ്ങൾ ഉപയോഗിക്കാൻ ശ്രമിക്കരുത്, ഡ്രൈവിംഗ് ചെയ്യുമ്പോൾ ടെക്സ്റ്റ് ചെയ്യരുത്. മനസ്സ് ശാന്തമായി സൂക്ഷിക്കുകയും ചുറ്റുപാടിനെ ശ്രദ്ധിക്കുകയും ചെയ്യുന്നത് സുരക്ഷിത ഡ്രൈവിംഗിന്റെ പ്രധാന തന്ത്രമാണ്.",
    "ഡിഫൻസീവ് ഡ്രൈവിംഗ് എന്നത് അപകടസാധ്യതകൾ മുൻകൂട്ടി കണക്കാക്കിയുള്ള സുരക്ഷിത ഡ്രൈവിംഗ് ശൈലിയാണ്. ഒരു നല്ല ഡ്രൈവർ എന്നും മറ്റുള്ള ഡ്രൈവർമാർ പിഴവ് ചെയ്യാൻ സാധ്യതയുള്ളതായി കരുതി മുൻകരുതലെടുക്കുന്നു. കണ്ണാടികൾ ഇടയ്ക്കിടെ പരിശോധിക്കൽ, ബ്ലൈൻഡ് സ്‌പോട്ടുകൾ മനസിലാക്കൽ, സ്റ്റിയറിംഗിൽ രണ്ടു കൈകളും വയ്ക്കൽ, സിഗ്നൽ നേരത്തെ നൽകൽ എന്നിവ ഇതിലടങ്ങുന്നു. പേടെസ്ട്രിയൻ, സൈക്ക്ലിസ്റ്റ്, വലിയ വാഹനങ്ങൾ, ആംബുലൻസ്/ഫയർ ഫോഴ്‌സ് പോലുള്ള അടിയന്തര വാഹനങ്ങൾ എന്നിവയെ ബഹുമാനിക്കുന്നത് റോഡിനെ എല്ലാവർക്കും കൂടുതൽ സുരക്ഷിതമാക്കുന്നു."
  ]
},
{
  "id": 5,
  "title_en": "Act, Rules and Regulations",
  "title_ml": "ആക്ട്, നിയമങ്ങളും ചട്ടങ്ങളും",
  "color": "#E1F2FE",
  "english": [
    "The Motor Vehicles Act is the primary law that governs road transport, licensing, registration, traffic rules, and penalties across India. Every driver must understand that driving is not just a skill but a legal responsibility that comes with strict obligations. The Act establishes the framework for issuing driving licenses, maintaining road safety standards, and ensuring that all vehicles on the road are registered and roadworthy. Following the Act is not optional; it is mandatory for every road user.",
    "One of the core components of the Act is the strict enforcement of traffic regulations. These regulations cover speed limits, lane discipline, overtaking rules, use of seat belts and helmets, and the mandatory use of indicators. The law clearly states that no person should drive in a manner that endangers life or property. Violating these rules can lead to heavy fines, license suspension, or even imprisonment depending on the severity of the offense. The intention of the law is to prevent accidents before they occur.",
    "The Act also includes detailed provisions on vehicle registration and fitness. Every vehicle must carry valid registration certificates, insurance documents, emission test certificates, and fitness certificates (for commercial vehicles). These rules ensure that vehicles running on the road are safe, pollution-free, and maintained in proper working condition. Driving an uninsured or unregistered vehicle is a serious offense under the Act and can result in the vehicle being seized.",
    "Another essential section of the Act relates to the rights and duties of drivers and pedestrians. Drivers must always give priority to pedestrians at zebra crossings, school zones, and intersections. The Act emphasizes courteous behavior, prohibiting rash driving, overspeeding, drunken driving, and road rage. Similarly, pedestrians also have responsibilities such as crossing only at designated areas, following signals, and avoiding sudden movements that might confuse drivers. These shared responsibilities ensure smooth and safe traffic movement.",
    "The updated Motor Vehicles Amendment Act introduces stricter penalties to reduce traffic violations and improve overall road safety. Heavy fines are imposed for drunk driving, overspeeding, driving without a license, using mobile phones while driving, and not wearing seat belts or helmets. The law also encourages digital compliance by allowing electronic documents such as digital RC, insurance, and DL through recognized apps. Overall, the Act aims to create a disciplined, responsible, and safe road culture for all citizens."
  ],
  "malayalam": [
    "റോഡ് ഗതാഗതം, ലൈസൻസിംഗ്, വാഹന രജിസ്ട്രേഷൻ, ട്രാഫിക് നിബന്ധനകൾ, ശിക്ഷകൾ എന്നിവ നിയന്ത്രിക്കുന്ന പ്രധാന നിയമമാണ് മോട്ടോർ വാഹന നിയമം. ഡ്രൈവിംഗ് ഒരു കഴിവ് മാത്രമല്ല, മറിച്ച് കടുത്ത ഉത്തരവാദിത്വങ്ങളോടുകൂടിയ ഒരു നിയമ ബാധ്യതയുമാണ്. ഈ നിയമം ഡ്രൈവിംഗ് ലൈസൻസ് നൽകുന്ന രീതിയും റോഡ് സുരക്ഷാ മാനദണ്ഡങ്ങളും വാഹനങ്ങളുടെ രജിസ്ട്രേഷനും നിർണ്ണയിക്കുന്നു. ഈ നിയമം പാലിക്കുന്നത് ഐച്ഛികമല്ല; എല്ലാ വഴിപയോഗകരും ഇത് നിർബന്ധമായും പാലിക്കണം.",
    "ട്രാഫിക് ചട്ടങ്ങൾ കർശനമായി നടപ്പിലാക്കുന്നതാണ് ഈ നിയമത്തിന്റെ പ്രധാന ഭാഗങ്ങളിൽ ഒന്ന്. വേഗപരിധി, ലെയിൻ ഡിസിപ്ലിൻ, ഒവർടേക്കിംഗ് നിയമങ്ങൾ, സീറ്റ് ബെൽറ്റ്/ഹെൽമറ്റ് നിർബന്ധം, സിഗ്നൽ ഉപയോഗം എന്നിവ ഇതിൽ ഉൾപ്പെടുന്നു. മറ്റുള്ളവരുടെ ജീവനും സ്വത്തിനും ഹാനികരമായ രീതിയിൽ ഡ്രൈവ് ചെയ്യുന്നത് നിയമവിരുദ്ധമാണ്. ഈ നിയമങ്ങൾ ലംഘിച്ചാൽ വലിയ പിഴകളും ലൈസൻസ് സസ്പെൻഷനും ഗുരുതരമായ കേസുകളിൽ തടവുമടക്കമുള്ള ശിക്ഷകൾ ലഭിക്കാം. അപകടങ്ങൾ ഉണ്ടാകുന്നതിന് മുമ്പുതന്നെ ഒഴിവാക്കുകയാണ് നിയമത്തിന്റെ ലക്ഷ്യം.",
    "വാഹന രജിസ്ട്രേഷൻ, ഫിറ്റ്നസ് എന്നിവ സംബന്ധിച്ച വിശദമായ വ്യവസ്ഥകളും ഈ നിയമത്തിൽ ഉൾപ്പെടുത്തിയിട്ടുണ്ട്. ഓരോ വാഹനത്തിനും രജിസ്ട്രേഷൻ സർട്ടിഫിക്കറ്റ്, ഇൻഷുറൻസ്, എമിഷൻ ടെസ്റ്റ് സർട്ടിഫിക്കറ്റ്, (കോമർഷ്യൽ വാഹനങ്ങൾക്ക്) ഫിറ്റ്നസ് സർട്ടിഫിക്കറ്റ് എന്നിവ നിർബന്ധമാണ്. ഇതു വഴി റോഡിൽ ഓടുന്ന വാഹനങ്ങൾ സുരക്ഷിതവും മലിനീകരണം കുറവുള്ളതും സാങ്കേതികമായി ശരിയായ നിലയിലുള്ളതുമാണ് എന്ന് ഉറപ്പാക്കുന്നു.ഇൻഷുറൻസില്ലാത്തതോ രജിസ്ട്രേഷൻ ഇല്ലാത്തതോ ആയ വാഹനങ്ങൾ ഓടിക്കുന്നത് ഗുരുതരമായ കുറ്റകൃത്യമാണ്.",
    "ഡ്രൈവർമാരുടെയും പേടെസ്ട്രിയൻമാരുടെയും അവകാശങ്ങളും ഉത്തരവാദിത്വങ്ങളും ഈ നിയമം വ്യക്തമായി വ്യക്തമാക്കുന്നു. സീബ്രാ ക്രോസിംഗ്, സ്കൂൾ ഏരിയ, ജങ്ഷൻ തുടങ്ങി പാതയാത്രക്കാരെ മുൻഗണന നൽകണമെന്ന് നിയമം പറയുന്നു. അപകടകരമായ ഡ്രൈവിംഗ്, മദ്യപിച്ച് ഡ്രൈവ് ചെയ്യൽ, അമിതവേഗം, റോഡ് റേജ് എന്നിവ കർശനമായി നിരോധിച്ചിരിക്കുന്നു. അതുപോലെ, പാതയാത്രക്കാരും നിശ്ചിത സ്ഥലങ്ങളിൽ മാത്രം റോഡ് മുറിക്കണം, സിഗ്നൽ പാലിക്കണം, ഡ്രൈവർമാരെ കുഴക്കും വിധം പെട്ടെന്നാണ് ചലനങ്ങൾ ഒഴിവാക്കണം. ഈ പരസ്പര ഉത്തരവാദിത്തങ്ങളിൽ നിന്നാണ് സുരക്ഷിത ട്രാഫിക് സംസ്കാരം ഉയരുന്നത്.",
    "മോട്ടോർ വാഹന ഭേദഗതി നിയമം കൂടുതൽ കർശനമായ പിഴകളും ശിക്ഷകളും കൊണ്ടുവന്നിട്ടുണ്ട്. മദ്യപിച്ച് ഡ്രൈവ് ചെയ്യൽ, അമിതവേഗം, ലൈസൻസില്ലാതെ ഡ്രൈവ് ചെയ്യൽ, മൊബൈൽ ഉപയോഗം, സീറ്റ് ബെൽറ്റ്/ഹെൽമറ്റ് ധരിക്കാത്തത് തുടങ്ങിയവയ്‌ക്ക് വലിയ പിഴയാണ്. കൂടാതെ ഡിജിറ്റൽ ആർ.സി, ഡിജിറ്റൽ ലൈസൻസ് എന്നിവ അംഗീകൃത ആപ്പുകൾ വഴി ഉപയോഗിക്കാനും നിയമം അനുമതി നൽകുന്നു. ഈ നിയമത്തിന്റെ ലക്ഷ്യം ഇന്ത്യയിൽ ശൃംഖലാബദ്ധവും ഉത്തരവാദിത്തപരവുമായ റോഡ് സംസ്കാരം സൃഷ്ടിക്കുകയാണ്."
  ]
}
]