export const drivingModules = [
  {
    id: 1,
    title: "Know Your Driving Basics (Key ideas and concepts on road safety topic)",
    malayalamTitle: "നിങ്ങളുടെ ഡ്രൈവിംഗ് അടിസ്ഥാനകാര്യങ്ങൾ അറിയുക (റോഡ് സുരക്ഷാ വിഷയത്തിലെ പ്രധാന ആശയങ്ങളും കാഴ്ചപ്പാടുകളും)",
    icon: "📝",
    color: "#FEE6E1",
    type: "driving_basics"
  },
  {
    id: 2,
    title: "Know Your Traffic Signs (Traffic sign hand signals & other road users)",
    malayalamTitle: "നിങ്ങളുടെ ട്രാഫിക് ചിഹ്നങ്ങൾ അറിയുക (ട്രാഫിക് ചിഹ്നങ്ങൾ, കൈകൾ കൊണ്ടുള്ള സിഗ്നലുകൾ, മറ്റ് റോഡ് ഉപയോക്താക്കൾ)",
    icon: "🚗",
    color: "#E1F2FE",
    type: "signs"
  },
  {
    id: 3,
    title: "Learners Test Question Bank (This will help to win Learners Exam)",
    malayalamTitle: "ലേണേഴ്സ് ടെസ്റ്റ് ചോദ്യ ബാങ്ക് (ലേണേഴ്സ് പരീക്ഷയിൽ വിജയിക്കാൻ ഇത് സഹായിക്കും)",
    icon: "🎯",
    color: "#FEEFE1",
    type: "questions"
  },
  {
    id: 4,
    title: "Learners Real Mock Exam (This will help to win Learners Exam)",
    malayalamTitle: "ലേണേഴ്സ് ടെസ്റ്റ് ചോദ്യ ബാങ്ക് (ലേണേഴ്സ് പരീക്ഷയിൽ വിജയിക്കാൻ ഇത് സഹായിക്കും)",
    icon: "⏳",
    color: "#FEE1EC",
    type: "mock"
  },
  {
    id: 5,
    title: "Concession card",
    malayalamTitle: " കാർഡ് കൈയിൽ പിടിച്ചിരിക്കുന്നു",
    icon: "💳",
    color: "#a2f7f0ff",
    type: "concession"
  },
  {
    id: 6,
    title: "IDTR",
    malayalamTitle: "ഐ.ഡി.ടി.ആർ",
    icon: "⏭️",
    color: "#5993C9",
    type: "IDTR"
  }
];